Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: ཚིག་གི་ལམ་སྣ་ཚོགས་བརྗོད་པས་ཀྱང་སེམས་ཅན་རྣམས་ཀྱི་དོན་བྱེད་དོ། །རིགས་ཀྱི་བུ་ཁོ་བོས་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཐམས་ཅད་དུ་འགྲོ་བ་ཐམས་ཅད་ཀྱི་རྗེས་སུ་སོང་བ་འདི་ཤེས་པར་ཟད་ན། ཁོ་བོས་བྱང་ཆུབ་སེམས་དཔའ་འགྲོ་བ་ཐམས་ཅད་དང་། མཉམ་པའི་ལུས་དང་ལྡན་པ་བདག་དང་། སེམས་ཅན་གྱི་ལུས་སུ་ཐ་མི་དད་པའི་ཏིང་ངེ་འཛིན་ཐོབ་པ། འཕྲུལ་བའི་འཁོར་ལོ་རྒྱ་ཆེན་པོས་སྲིད་པའི་ལམ་གྱི་རྒྱུད་ཐམས་ཅད་དུ་ཁྱབ་པ། འཇིག་རྟེན་གྱི་སྐྱེ་བ་ཐམས་ཅད་རང་གི་ལུས་ལ་རྗེས་སུ་སྤྱོད་པ། འགྲོ་བ་ཐམས་ཅད་ཀྱིས་ལྟ་ན་དགའ་ཞིང་ཡིད་དུ་འོང་བའི་སྤྲུལ་པའི་འཁོར་ལོ་ལ་བརྩོན་པ། འགྲོ་བ་ཐམས་ཅད་ཀྱི་རིགས་དང་རྒྱུད་དང་ཚེར་སྐྱེ་བ་རབ་ཏུ་སྟོན་པ། བསྐལ་པ་ཐམས་ཅད་དུ་གནས་པ་ལ་ཐོགས་པ་མེད་པའི་སྨོན་ལམ་གྱི་འཁོར་ལོ་དང་ལྡན་པ། མིག་འཕྲུལ་ལྟ་བུའི་སྤྱོད་པ་རྣམ་པར་ཕྱེ་བའི་སྣང་བ་རབ་ཏུ་ཐོབ་པ། འགྲོ་བ་ཐམས་ཅད་ཀྱི་དོན་བྱེད་ཀྱང་། གོས་པ་མེད་པར་གནས་པ་ལ་བརྩོན་པ།
en: I benefit beings through speaking in various languages.

source: དུས་གསུམ་གྱི་འགྲོ་བའི་དབྱིངས་མཉམ་པ་ཉིད་ཁོང་དུ་ཆུད་པ། ཡེ་ཤེས་ཀྱི་དབྱིངས་བདག་མེད་པ་དང་ལྡན་པས། སྣང་བར་བྱས་པའི་སྙིང་རྗེ་ཆེན་པོ་མཐའ་ཡས་པའི་སྙིང་པོ་དང་ལྡན་པ། འགྲོ་བ་ཐམས་ཅད་ཀྱི་དགེ་བའི་རྩ་བ་ཡོངས་སུ་བསྐྱེད་པ་ལ་མངོན་པར་བརྩོན་པ། དེ་དག་གི་སྤྱོད་པ་ཤེས་པའམ།
en: “Noble one, in that way, I know this bodhisattva conduct that is all-pervasive and omnipresent, but how could I know the conduct or describe the qualities of those bodhisattvas who possess bodies that are the same as those of all beings; who have attained the samādhi called identical to the bodies of all beings; who pervade all the classes of existence with a vast wheel of emanations; who perform in their own bodies all worldly births; who are dedicated to the wheel of beautiful emanations that all beings delight to see; who manifest births in the families, clans, and lives of all beings; who possess the unimpeded wheel of aspiration to dwell in all kalpas; who have attained the radiance of the display of conduct that is like an illusion; who are dedicated to benefiting all beings and yet remain stainless; who have realized the equality of all the realms of beings in the three times; who possess the essence of infinite compassion illuminated by the realm of the wisdom of selflessness; and who are dedicated to generating the roots of merit of all beings?

source: སོང་རིགས་ཀྱི་བུ་ལྷོ་ཕྱོགས་ཀྱི་རྒྱུད་འདི་ཉིད་ན་ཡུལ་ཁམས་ཆེན་པོ་ཞེས་བྱ་བ་ཡོད་དེ། དེ་ན་སྤོས་འཚོང་གི་ཚོང་དཔོན་ལོངས་སྤྱོད་ཨུཏ་པ་ལ་ཞེས་བྱ་བ་འདུག་གིས།
en: In this southern region, in a land called Pṛthurāṣṭra, there dwells a perfume-seller head merchant by the name of Utpalabhūti.

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་ཀུན་ཏུ་རྒྱུ་ཐམས་ཅད་དུ་འགྲོ་བའི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། ཀུན་ཏུ་རྒྱུ་ཐམས་ཅད་དུ་འགྲོ་བ་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས། ཡང་དང་ཡང་བལྟས་ཏེ། ཀུན་ཏུ་རྒྱུ་ཐམས་ཅད་དུ་འགྲོ་བའི་དྲུང་ནས་སོང་ངོ་། །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལུས་དང་སྲོག་ལ་ནི་མི་ལྟ། སྲིད་པའི་ལོངས་སྤྱོད་དང་ཡོངས་ས་ཟིན་པ་དང་། ཉེ་བར་བླངས་པ་ལ་མངོན་པར་ཆགས་པའི་གནས་ཐམས་ཅད་ལ་ནི་མི་ལྟ་སེམས་ཅན་གྱི་ཡུལ་གྱི་དགའ་བ་ཐམས་ཅད་ལ་ནི་མི་ལྟ། གཟུགས་དང་སྒྲ་དང་དྲི་དང་། བྲོ་དང་། རེག་བྱ་ཐམས་ཅད་ལ་ནི་མི་ལྟ། གཡོག་འཁོར་དང་ལོངས་སྤྱོད་དང་། ཉེ་བར་སྤྱོད་པ་ཐམས་ཅད་ལ་ནི་མི་ལྟ་སྟེ། རྒྱལ་སྲིད་དང་དབང་ཕྱུག་གི་དབང་གི་བདེ་བ་ཐམས་ཅད་ལ་ནི་མི་ལྟ་ལ་སངས་རྒྱས་ཀྱི་ཞིང་བླ་ན་མེད་པར་ཡོངས་སུ་དག་པ་མངོན་པར་བསྒྲུབས་པས་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། གདུལ་བ་དང་ཡོངས་སུ་དག་པར་བྱ་བ་ལ་ལྟ་བ། མཆོད་པ་དང་བསྙེན་བཀུར་བ་དང་། རིམ་གྲོ་བྱ་བས་མི་ངོམས་པས་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ལ་ལྟ་བ་དང་། རང་བཞིན་མེད་པ་ཡོངས་སུ་ཤེས་པའི་ཡེ་ཤེས་ཁོང་དུ་ཆུད་པར་བྱ་བའི་ཕྱིར་ཆོས་ཐམས་ཅད་ལ་བལྟ་བ་ཡོན་ཏན་རྒྱ་མཚོ་ཐམས་ཅད་ཀྱི་དོན་དུ་ནན་ཏན་བྱ་བ་ལས་ཉམ་པ་མེད་པར་བྱ་བའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའི་ཡོན་ཏན་ཐམས་ཅད་ལ་བལྟ་བ་དང་། བསྐལ་པ་ཐམས་ཅད་དུ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་ཡང་དག་པར་གནས་པར་བྱ་བའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་སྨོན་ལམ་ཆེན་པོ་ལ་ལྟ་བ།
en: Then Sudhana, the head merchant’s son, bowed his head to the feet of the parivrājaka Sarvagamin, circumambulated the parivrājaka Sarvagamin a hundred thousand times, keeping him to his right, and, looking back again and again, departed from the presence of the parivrājaka Sarvagamin.

source: དེ་བཞིན་གཤེགས་པའི་འཁོར་གྱི་དཀྱིལ་འཁོར་རྒྱ་མཚོ་ཐམས་ཅད་དུའཇུག་པར་བྱ་བ་ལ་ལྟ་བ། ཏིང་ངེ་འཛིན་གྱི་སྒོ་རེ་རེར་བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་གྲངས་མེད་པ་ཐམས་ཅད་གཟུང་བ་ལ་རྣམ་པར་འཕྲུལ་པར་བྱ་བའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་གྱི་སྒོ་ཐམས་ཅད་ལ་ལྟ་བ། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་འཁོར་ལོ་ཡང་དག་པར་བཟུང་བས་མི་ངོམས་པར་བྱ་བའི་ཕྱིར། ཆོས་ཀྱི་ཡེ་ཤེས་སྣང་བའི་འཁོར་ལོ་ཐམས་ཅད་ལ་ལྟ་བ། དེ་སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའི་ཡོན་ཏན་འདི་དག་དང་།
en: Utpalabhūti Chapter 24 Sudhana, the head merchant’s son, had no regard for his life or body; he had no regard for engaging in dedication to obtaining and possessing the pleasures of existence; he had no regard for the objects of perception that beings delight in; he had no regard for forms, sounds, smells, tastes, and textures; he had no concern for enjoying retinues and pleasures; he had no regard for any of the pleasures of the power of kingship and sovereignty; he was focused on attaining the highest purification of a buddha realm for the pure ripening and guiding of all beings; he was focused on never being satisfied with the extent of his offering to, honoring, and serving all the tathāgatas; he was focused on all phenomena with the wisdom that knows their nature; he was focused on the qualities of bodhisattvas so that there would be no decline in his practice, which had the entire ocean of those qualities as its goal; he was focused on the great prayers of all bodhisattvas so as to maintain bodhisattva conduct throughout all kalpas; he was focused on entering the ocean of the circles of the followers of all tathāgatas; he was focused on all gateways of bodhisattva samādhis so as to manifest the attainment of all countless bodhisattva samādhis through each samādhi gateway; he was focused on all the light of wisdom of all Dharma wheels so as to never be satisfied with the extent of his obtaining Dharma wheels from all the tathāgatas; and he was focused on the kalyāṇamitras, who are the source of qualities, because the kalyāṇamitras are the source of the qualities of the buddhas, the bodhisattvas, and others.

source: གཞན་དག་ཀྱང་དགེ་བའི་བཤེས་གཉེན་ལས་འབྱུང་བ་སྟེ། དགེ་བའི་བཤེས་གཉེན་ནི་དེ་དག་ཐམས་ཅད་ཀྱི་འབྱུང་གནས་སུ་གྱུར་པ་མ་ཡིན་པར་ཡང་དག་པར་ལྟ་ཞིང་མཐར་གྱིས་ཡུལ་ཁམས་ཆེན་པོ་གང་ན་བ་དེར་ཕྱིན་ནས།
en: Sudhana eventually arrived at the land called Pṛthurāṣṭra.

source: སྤོས་འཚོང་གི་ཚོང་དཔོན་ལོངས་སྤྱོད་ཨུད་པ་ལ་ཡོངས་སུ་རྨེད་ཅིང་ཚོལ་ཚོལ་བ་ལས་མཐོང་ནས།
en: He looked and searched for the perfume-seller head merchant by the name of Utpalabhūti.

source: སྤོས་འཚོང་གི་ཚོང་དཔོན་ལོངས་སྤྱོད་ཨུད་པ་ལ་གང་ན་བ་དེར་ཕྱིན་ཏེ།
en: He saw the perfume-seller head merchant Utpalabhūti and approached him.

source: དྲུང་དུ་སོང་ནས། སྤོས་འཚོང་གི་ཚོང་དཔོན་ལོངས་སྤྱོད་ཨུད་པ་ལའི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། སྤོས་འཚོང་གི་ཚོང་དཔོན་ལོངས་སྤྱོད་ཨུད་པ་ལ་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས། སྤོས་འཚོང་གི་ཚོང་དཔོན་ལོངས་སྤྱོད་ཨུད་པ་ལའི་མདུན་དུ་འདུག་ཏེ།
en: After approaching him, Sudhana bowed his head to the perfume-seller head merchant Utpalabhūti’s feet, circumambulated the perfume-seller head merchant Utpalabhūti many hundreds of thousands of times, and sat down before the perfume-seller head merchant Utpalabhūti.

source: ཐལ་མོ་སྦྱར་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ། །འཕགས་པ་བདག་སངས་རྒྱས་ཐམས་ཅད་དང་མཉམ་པའི་ཡེ་ཤེས་འཚལ་ཏེ།
en: With his hands placed together in homage, he said, “Ārya, I seek the wisdom that is the same as that of all the buddhas.

source: སངས་རྒྱས་ཐམས་ཅད་ཀྱི་སྔོན་གྱི་སྨོན་ལམ་གྱི་དཀྱིལ་འཁོར་ཡོངས་སུ་རྫོགས་པར་བགྱི་བར་ཡང་དགའ། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་སྐུ་ཡོངས་སུ་གྲུབ་པར་བགྱི་བར་ཡང་དགའ། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཡེ་ཤེས་ཀྱི་སྐུ་ཡོངས་སུ་འཚལ་བར་བགྱི་བར་ཡང་དགའ། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའི་དཀྱིལ་འཁོར་ཐམས་ཅད་ཡོངས་སུ་དག་པར་བགྱི་བར་ཡང་དགའ། བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་གྱི་དཀྱིལ་འཁོར་ཐམས་ཅད་སྣང་བར་བགྱིད་པར་ཡང་དགའ། བྱང་ཆུབ་སེམས་དཔའི་གཟུངས་ཀྱི་དཀྱིལ་འཁོར་ཐམས་ཅད་ཡོངས་སུ་བརྟེན་པར་ཡང་དགའ། སྒྲིབ་པའི་དཀྱིལ་འཁོར་ཐམས་ཅད་རྣམ་པར་གཏོར་བར་ཡང་དགའ། ཞིང་གི་དཀྱིལ་འཁོར་ཐམས་ཅད་དུ་རྣམ་པར་རྒྱུ་བར་ཡང་འཚལ་ནས། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡང་དག་པར་ཞུགས་ན། ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་།
en: I rejoice in the fulfillment of the field of prayers made in the past by all the buddhas, I rejoice in the accomplishment of the Dharma body of all the buddhas, I seek the wisdom body of all the buddhas, I rejoice in the purification of all the fields of bodhisattva conduct, I rejoice in the light of all the fields of bodhisattva samādhis, I rejoice in the stability of all the fields of the bodhisattva power of mental retention, I rejoice in the dispelling of the entire field of kleśas, I seek to travel in all the fields of the realms, and I have set out upon the highest complete enlightenment, but I do not know how bodhisattvas should train in bodhisattva conduct and how they should practice it, and how through having practiced in that way all bodhisattvas become omniscient.”

source: ཇི་ལྟར་ནན་ཏན་དུ་བགྱི་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བགྱིས་ན་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་འབྱུང་བར་འགྱུར་བར་མ་འཚལ་ཏོ། །སྨྲས་པ་རིགས་ཀྱི་བུ་དེ་ལྟར་ཁྱོད་ཀྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་ལེགས་སོ་ལེགས་སོ། །
en: Utpalabhūti said to him, “Noble one, it is excellent, excellent, that you have developed the aspiration for the highest, complete enlightenment.

source: རིགས་ཀྱི་བུ་ཁོ་བོ་ནི་སྤོས་ཐམས་ཅད་ཤེས་ཏེ། སྤོས་སྦྱར་བ་ཐམས་ཅད་དང་། བདུག་སྤོས་ཐམས་ཅད་དང་།
en: “Noble one, I know all perfumes.

source: བདུག་སྤོས་སྦྱར་བ་ཐམས་ཅད་དང་། བྱུག་པ་ཐམས་ཅད་དང་། བྱུག་པ་སྦྱར་བ་ཐམས་ཅད་དང་། ཕྱེ་མ་ཐམས་ཅད་དང་། ཕྱེ་མ་སྦྱར་བ་ཐམས་ཅད་དང་།
en: I know about all combined perfumes, all incenses, all combinations of perfumes and incenses, all ointments, all combined ointments, all powders, all combinations of powders, and all perfumes, ointments, and powders.

source: སྤོས་དང་། བྱུག་པ་དང་། ཕྱེ་མའི་རྣམ་པ་ཐམས་ཅད་ཀྱང་ཤེས་ཏེ། ལྷའི་སྤོས་ཀྱང་ཤེས་སོ། །ཀླུ་དང་གནོད་སྦྱིན་དང་དྲི་ཟ་དང་།
en: I know the perfumes of the devas.

source: ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། མི་དང་མི་མ་ཡིན་པའི་སྤོས་ཀྱང་ཤེས་སོ། །
en: I also know the perfumes of the nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, mahoragas, humans, and nonhumans.

source: ནད་གསོ་བའི་སྤོས་དང་། ཡིད་མི་བདེ་བ་བསྩལ་བའི་སྤོས་དང་།
en: “I know the perfumes that heal sickness.

source: འཇིག་རྟེན་གྱི་དགའ་བ་ཡོངས་སུ་བསྐྱེད་པའི་སྤོས་དང་། ཉོན་མོངས་པ་འབར་བར་བྱ་བའི་སྤོས་དང་། ཉོན་མོངས་པ་ཞི་བར་བ་བའི་སྤོས་དང་། འདུས་བྱས་ཀྱི་དགའ་བ་དང་། བདེ་བ་སྣ་ཚོགས་ཡོངས་སུ་བསྐྱེད་པའི་སྤོས་དང་། འདུས་བྱས་ཐམས་ཅད་ལས་སྐྱོ་བ་ཡོངས་སུ་བསྐྱེད་པའི་སྤོས་དང་། བག་བྱ་བའི་གནས་ཐམས་ཅད་སེལ་བའི་སྤོས་དང་། སངས་རྒྱས་ཡིད་ལ་བྱ་བའི་རྒྱུད་ཡང་དག་པར་འབྱུང་བའི་སྤོས་དང་། ཆོས་ཀྱི་ཚུལ་ཁོང་དུ་ཆུད་པར་བྱ་བའི་སྤོས་དང་། འཕགས་པས་སྤྱད་པའི་སྤོས་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྤོས་རྣམ་པ་ཐ་དད་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ས་ཐམས་ཅད་རྣམ་པར་དགོད་པའི་སྤོས་ཀྱང་ཤེས་ཏེ། །
en: I also know the perfumes that dispel unhappiness, the perfumes that give rise to worldly happiness, the perfumes that cause the kleśas to blaze, the perfumes that cause kleśas to cease, the perfumes that create various kinds of composite happiness and bliss, the perfumes that create composite sadness, the perfumes that dispel all intoxication and carelessness, the perfumes that accomplish a continuous focus on the buddhas, the perfumes of understanding the way of the Dharma, the perfumes of ārya conduct, the various bodhisattva perfumes, and the perfumes of being established on all the bodhisattva levels.

source: ཁོ་བོས་སྤོསདེ་དག་ཐམས་ཅད་རྣམ་པ་ཇི་ལྟ་བུའང་རབ་ཏུ་ཤེས་སོ། །འབྱུང་བ་དང་། སྐྱེ་བ་དང་། འགྲུབ་པ་དང་། ཡོངས་སུ་རྫོགས་པ་དང་།
en: I know the aspects of all those perfumes.

source: ཡོངས་སུ་དག་པ་དང་། ཡོངས་སུ་སྤང་བ་དང་། རབ་ཏུ་སྦྱར་བ་དང་། ཡོངས་སུ་སྤྱད་པ་དང་། ཡུལ་དང་མཐུ་དང་ལས་དང་རྒྱུ་ཡང་རབ་ཏུ་ཤེས་སོ། །
en: I also know their origin, creation, accomplishment, perfection, purification, elimination, combination, usage, object, power, action, and cause.

source: རིགས་ཀྱི་བུ་མིའི་འཇིག་རྟེན་ན་སྤོས་གླང་པོའི་སྙིང་པོ་ཞེས་བྱ་བ། ཀླུ་ཡོངས་སུ་འཁྲུག་པར་བྱེད་པ་ཡོད་དེ།
en: “Noble one, in the world there is the perfume called elephant essence that disconcerts the nāgas.

source: དེའི་རི་ལུ་ཏིལ་གྱི་འབྲུ་ཙམ་གྱིས་ཀྱང་ཡུལ་ཁམས་ཆེན་པོ་ཐམས་ཅད་སྤོས་ཀྱི་སྤྲིན་གྱི་དྲ་བ་ཤིན་ཏུ་སྟུག་པས་ཀུན་ནས་ཁེབས་པར་གྱུར་ཏེ།
en: A pellet merely the size of a sesame seed will pervade the entire land of Pṛthurāṣṭra with a thick net of a cloud of perfume.

source: ཞག་བདུན་དུ་སྤོས་ཆུའི་རྒྱུན་ཤིན་ཏུ་ཕྲ་བའི་ཆར་མངོན་པར་འབབ་བོ། །
en: For seven days there will fall a fine rain of scented water.

source: དེའི་ཚེ་སེམས་ཅན་སུའི་ལུས་སམ་གོས་ལ་སྤོས་ཆུའི་རྒྱུན་དེ་དག་གིས་བབ་པར་གྱུར་པ་དེ་དག་ཐམས་ཅད་ཀྱང་མེ་ཏོག་གསེར་གྱི་ཁ་དོག་དུ་འདུག་པས་རྣམ་པར་བརྒྱན་པའི་གོས་དང་ལུས་སུ་འགྱུར་རོ། །ཁང་པ་དང་གཞལ་མེད་ཁང་དང་། ཁང་པ་བརྩེགས་པ་གང་དུ་བབ་པར་གྱུར་པ་དེ་དག་ཐམས་ཅད་ཀྱང་མེ་ཏོག་གསེར་གྱི་ཁ་དོག་ལྟ་བུར་རྣམ་པར་བརྒྱན་པར་གནས་སོ། །
en: At that time, when that scented water falls on any being’s body or clothing, all their bodies and clothing will become adorned with golden flowers.

source: སེམས་ཅན་ཁྱིམ་གྱི་ནང་ན་གནས་པ་གང་གིས་སྤོས་ཀྱི་སྤྲིན་གྱི་དྲ་བ་དེ་ལ་རླུང་གིས་མ་དད་པའི་དྲི་ཚོར་བར་གྱུར་པ་དེ་དག་ཐམས་ཅད་ཀྱང་ཞག་བདུན་དུ་དགའ་བ་དང་། མོས་པ་ཆེན་པོས་ཡོངས་སུ་རྒྱས་པར་འགྱུར་ཏེ། ལུས་དང་སེམས་ལ་བདེ་བ་དང་དགའ་བ་སྣ་ཚོགས་ཀྱང་རབ་ཏུ་མྱོང་བར་འགྱུར་རོ། །
en: Those beings who are indoors and smell the scent that is brought in by the breeze from that net of clouds of perfume will all have increased happiness and aspiration for seven days and will experience various kinds of mental and physical happiness and pleasure, and they will have no illness that is caused by the disturbance of the elements in their bodies or is the result of harm caused by others.

source: དེ་དག་གི་ལས་ལ་ཡང་ཁམས་འཁྲུག་པ་ལ་ས་གྱུར་པའམ། གཞན་གྱིས་གནོད་པར་བྱ་བ་ལས་གྱུར་པའི་ནད་ཀྱང་འབྱུང་བར་འགྱུར་བ་མེད་དོ། །སེམས་ཀྱི་སྡུག་བསྔལ་བ་དང་ཡིད་མི་བདེ་བ་ཡང་མི་འབྱུང་ངོ་། །
en: They will have no suffering or unhappiness.

source: འཇིགས་པའམ། སྡང་བའམ་བག་ཚ་བའམ། ཡིད་འཁྲུག་པ་འམ། གནོད་སེམས་ཀྱང་མི་རྒྱུ་སྟེ།
en: They will have no fear, no terror, no apprehension, no disturbance of mind, and no malice.

source: དེ་དག་ཐམས་ཅད་ཞག་བདུན་དུ་དགའ་བ་དང་བདེ་བ་སྐྱེས་ཏེ། གཅིག་ལ་གཅིག་བྱམས་པའི་སེམས་སུ་འགྱུར་རོ།
en: For seven days there will arise happiness and joy, and they will be kind to one another.

source: རིགས་ཀྱི་བུ་ཁོ་བོ་ནི་དེ་དག་དེ་ལྟར་དགའ་བ་དང་། ཉམས་བདེ་བ་སྐྱེས་པ་རྣམས་ལ་བསམ་པ་དག་པར་བྱ་བའི་ཕྱིར་ཅི་ནས་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ངེས་པར་འགྱུར་བ་དེ་ལྟར་ཆོས་སྟོན་ཏོ། །
en: “Noble one, in order to purify the thoughts of those who are experiencing happiness and joy, I teach them the Dharma so that they will definitely have the highest, complete enlightenment.

source: གཞན་ཡང་རིགས་ཀྱི་བུ་རི་མ་ལ་ཡ་ལས་འབྱུང་བའི་ཙན་དན་ས་སྟེང་ས་དམ་པ་ཞེས་བྱ་བ་ཡོད་དེ།
en: “Moreover, noble one, there is sandalwood called gośīrṣa that comes from the Malaya mountains.

source: དེ་ལུས་ལ་བསྐུས་ན་མེའི་འོབས་སུ་མཆོངས་ཀྱང་ཚིག་པ་མེད་དོ།
en: If you rub it on your body, you can jump into a great fire and you will not be burned.

source: རིགས་ཀྱི་བུ་རྒྱ་མཚོའི་མཐའ་ནས་འབྱུང་བའི་སྤོས་གཞན་གྱིས་ཐུབ་པ་མེད་པ་ཞེས་བ་ཡོད་དེ།
en: “Noble one, there is a perfume called invincible that comes from the ends of the ocean.

source: དེ་རྔའམ་དུང་ལ་བསྐུས་ན་དེའི་སྒྲས་གཞན་གྱི་འཁོར་ཐམས་ཅད་ཕམ་པར་འགྱུར་རོ། །
en: If you rub it on a drum or a horn, its sound will defeat all the followers of others.

source: རིགས་ཀྱི་བུ་མཚོ་མ་དྲོས་པའི་ངོགས་ནས་འབྱུང་བའི་ཨ་ག་རུ་ནག་པོ་པད་མོའི་སྙིང་པོ་ཞེས་བྱ་བ་ཡོད་དེ།
en: “Noble one, there is the black agarwood called lotus essence that comes from Lake Anavatapta.

source: དེའི་རི་ལུ་ཏིལ་གྱི་འབྲུ་ཙམ་གཅིག་གི་དྲིས་ཀྱང་འཛམ་བུའི་གླིང་ཐམས་ཅད་རྒྱས་པར་གང་བར་འགྱུར་ཏེ།
en: The smell from a pellet the size of a sesame seed will fill all of Jambudvīpa.

source: སེམས་ཅན་གང་གིས་སྤོས་ཀྱི་དྲི་དེ་ཚོར་བ་དེ་དག་ཐམས་ཅད་ཀྱང་སྡིག་པ་ལ་སྨོད་ཅིང་སྡོམ་པའི་སེམས་རབ་ཏུ་ཐོབ་བར་འགྱུར་རོ། །
en: Every being that smells that perfume will renounce bad actions and gain a controlled mind.

source: རིགས་ཀྱི་བུ་རིའི་རྒྱལ་པོ་ཁ་བ་ཅན་ལས་འབྱུང་བའི་སྤོས་ཀྱི་རྣམ་པ་འོད་དང་ལྡན་པ་ཞེས་བྱ་བ་ཡོད་དེ།
en: “Noble one, there is a kind of perfume called luminescent that comes from the Himalaya, the king of mountains.

source: དེའི་དྲི་ཚོར་ན་སེམས་ཅན་དེ་དག་འདོད་ཆགས་དང་བྲལ་བའི་སེམས་སུ་འགྱུར་ཏེ།
en: If one smells its scent, the mind will become freed from desire.

source: ཁོ་བོ་ནི་དེ་དག་ལ་ཅི་ནས་ཀྱང་རྡུལ་དང་བྲལ་བའི་དཀྱིལ་འཁོར་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཐོབ་པར་འགྱུར་བ་དེ་ལྟར་ཆོས་སྟོན་ཏོ། །
en: I teach them the Dharma so that they will attain the samādhi called the stainless field.

source: རིགས་ཀྱི་བུ་སྲིན་པོའི་འཇིག་རྟེན་ནས་འབྱུང་བའི་སྤོས་ཀྱི་རྣམ་པ་རྒྱ་མཚོའི་སྙིང་པོ་ཞེས་བྱ་བ་ཡོད་དོ། །དེ་ནི་འཁོར་ལོས་སྒྱུར་བའི་ལོངས་སྤྱོད་ཀྱི་དོན་དུ་འབྱུང་སྟེ།
en: “Noble one, there is a kind of perfume called the essence of the sea that comes from the land of the rākṣasas and has been produced for the enjoyment of a cakravartin king.

source: དེས་བདུགས་མ་ཐག་ཏུ་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོའི་དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་པ་ཡང་ནམ་མཁའི་དབྱིངས་ལ་གནས་སོ། །
en: As soon as he is perfumed by it, the cakravartin’s fourfold army appears in the sky.

source: རིགས་ཀྱི་བུ་ལྷའི་འཁོར་ཆོས་བཟང་པོ་ནས་འབྱུང་བའི་སྤོས་ཀྱི་རྣམ་པར་རྣམ་པར་འབྱེད་པ་ཞེས་བྱ་བ་ཡོད་དེ།
en: “Noble one, there is a kind of perfume called array of beauty that comes from Sudharma, the assembly hall of the devas.

source: དེས་བདུགས་མ་ཐག་ཏུ་ལྷ་རྣམས་སངས་རྒྱས་ཀྱི་དྲི་ཞིམ་པོ་དྲན་པར་འགྱུར་རོ། །
en: As soon as the devas are perfumed by it, they gain the memory of the pleasant aroma of the buddhas.

source: རིགས་ཀྱི་བུ་ལྷའི་རྒྱལ་པོ་རབ་མཚེ་མའི་གནས་ན་སྤོས་ཀྱི་རྣམ་པ་དག་པའི་མཛོད་ཅེས་བྱ་བ་ཡོད་དེ།
en: “Noble one, there is a kind of perfume called pure treasure in the paradise of Suyāma, the king of devas.

source: དེས་བདུག་མ་ཐག་ཏུ་མཚེ་མའི་ལྷའི་བུ་ཐམས་ཅད་ལྷའི་རྒྱལ་པོ་རབ་མཚེ་མའི་དྲུང་དུ་འདོང་ངོ་། །དེ་དག་དེར་ཕྱིན་ནས་ཀྱང་ལྷའི་རྒྱལ་པོ་རབ་མཚེ་མས་ཆོས་ཀྱི་གཏམ་བྱའོ། །
en: As soon as they are perfumed by it, all Suyāma’s devas come before deva king Suyāma, and when they are in his presence, the deva king Suyāma talks to them about the Dharma.

source: རིགས་ཀྱི་བུ་དགའ་ལྡན་གྱི་གནས་ན། སྤོས་ཀྱི་རྣམ་པ་སིན་དུ་བ་ར་ཞེས་བྱ་བ་ཡོད་དེ།
en: “Noble one, there is a kind of perfume called chaste tree in Tuṣita.

source: དེའི་སྤོས་ཀྱི་དུད་པ་བྱང་ཆུབ་སེམས་དཔའ་ཚེ་གཅིག་གིས་ཐོགས་པ་ཆོས་ཀྱི་སྟན་ལ་འདུག་པའི་མདུན་དུ་ཕྱུང་ན། སྤོས་ཀྱི་སྤྲིན་ཆེན་པོས་ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་རྒྱས་པར་གང་ཞིང་། དེ་བཞིན་གཤེགས་པའི་འཁོར་གྱི་དཀྱིལ་འཁོར་ཐམས་ཅད་དུ་རྒྱན་རྣམ་པ་སྣ་ཚོགས་དང་ལྡན་པའི་ཆོས་ཀྱི་སྤྲིན་ཆེན་པོའི་ཆར་རབ་ཏུ་འབབ་བོ། །
en: When its aroma reaches bodhisattvas with one life remaining and who are upon their Dharma seats, a great cloud of perfume fills the entire realm of phenomena, and from great Dharma clouds that have a variety of adornments a rain falls onto all the circles of followers of the tathāgatas.

source: རིགས་ཀྱི་བུ་ལྷའི་རྒྱལ་པོ་རབ་འཕྲུལ་དགའི་གནས་ན། སྤོས་ཀྱི་རྣམ་པ་ཡིད་འཕྲོག་པ་ཞེས་བྱ་བ་ཡོད་དེ།
en: “Noble one, there is a kind of perfume called captivating in the paradise of the deva king Sunirmita.

source: དེས་ལྷའི་རྒྱལ་པོ་རབ་འཕྲུལ་དགའི་གནས་སུ་བདུགས་ན། ཞག་བདུན་དུ་ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་བསམ་གྱིས་མི་ཁྱབ་པ་འབབ་པར་འགྱུར་རོ། །རིགས་ཀྱི་བུ་ཁོ་བོས་ནི་སྤོས་སྦྱར་བ་དེ་ཤེས་སུ་ཟད་ན། ཁོ་བོས་བྱང་ཆུབ་སེམས་དཔའ་སྐྱོན་གྱི་དྲི་མ་མེད་པ་འདོད་པའི་འཇིག་རྟེན་ཐམས་ཅད་ནས་གྱེན་དུ་འཕགས་པ། ཉོན་མོངས་པའི་བདུད་ཀྱི་ཞགས་པ་དང་བྲལ་བ། སྲིད་པའི་ལམ་གྱི་རྒྱུད་ཐམས་ཅད་ལས་ཤིན་ཏུ་འདས་པ།
en: When there is that aroma in the paradise of the deva king Sunirmita, there falls an inconceivable rain from clouds of Dharma for seven days.

source: ཡེ་ཤེས་སྒྱུ་མའི་རྣམ་པ་དང་། གཟུགས་ཀྱིས་རྣམ་པར་སྤྱོད་པ། འཇིག་རྟེན་ཐམས་ཅད་ཀྱིས་གོས་པ་མེད་པ། ཆགས་པ་མེད་པའི་ངང་ཚུལ་ཅན། སྒྲིབ་པ་མེད་པར་ཡེ་ཤེས་ཀྱི་དཀྱིལ་འཁོར་རྣམ་པར་དག་པ། ཐོགས་པ་མེད་པའི་ཡེ་ཤེས་ཀྱི་སྤྱོད་ཡུལ་དང་།
en: “Noble one, I know how to combine perfumes, but how could I know the conduct or describe the qualities of those bodhisattvas who have no stain of faults and have transcended the entire realm of desire, who are free from the noose of the māra of the kleśas, who have transcended all the continuums of the states of existence, who perform conduct with bodies and the aspect of the illusion of wisdom, who are unstained by any world, who have the state of being without desire, who have the pure field of wisdom that is unobscured, who have the range and scope of unimpeded wisdom, who do not dwell in any basis or location, and who know the conduct of those who move in all the bases and locations of existence?

source: ཡུལ་དུ་ལྡན་པ། ཀུན་གྱི་གཞིའི་གནས་ཐམས་ཅད་ལ་མི་གནས་པར། སྲིད་པའི་ཀུན་གཞི་དང་གནས་ཐམས་ཅད་དུ་རྒྱུ་བ་རྣམས་ཀྱི་སྤྱོད་པ་ཆེ་ཤེས་པའམ། ཡོན་ཏན་བརྗོད་པའམ། ཚུལ་ཁྲིམས་ཀྱི་སྤྱོད་པ་རྣམ་པར་དག་པའི་སྒོ་ཡོངས་སུ་སྨོས་པའམ།
en: How could I elucidate the gateway of their pure practice of correct conduct?

source: ཁ་ན་མ་ཐོ་བ་མེད་པའི་སྤྱོད་པ་བརྗོད་པའམ།
en: How could I describe their faultless conduct?

source: གནོད་པར་སྤྱོད་པ་མེད་པའི་ལུས་དང་ངག་དང་ཡིད་ཀྱི་རྒྱུད་བསྟན་པར་ནུས་རེ་སྐན། །
en: How could I teach their continuum of body, speech, and mind that is devoid of harmful conduct? “Depart, noble one.

source: སོང་རིགས་ཀྱི་བུ་ལྷོ་ཕྱོགས་ཀྱི་རྒྱུད་འདི་ཉིད་ན།
en: In this southern region, there is a town named Kūṭāgāra.

source: གྲོང་ཁྱེར་ཁང་པ་བརྩེགས་པ་ཞེས་བྱ་བ་ཡོད་དེ།
en: There dwells a mariner by the name of Vaira.

source: དེ་ན་མཉན་པ་དཔའ་བོ་ཞེས་བྱ་བ་འདུག་གིས་དེའི་དྲུང་དུ་སོང་ལ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བྱ་བ་དང་།
en: Go to him and ask him, ‘How should a bodhisattva train in bodhisattva conduct?

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས། སྤོས་འཚོང་གི་ཚོང་དཔོན་ལོངས་སྤྱོད་ཨུད་པ་ལའི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ནས། སྤོས་འཚོང་གི་ཚོང་དཔོན་ལོངས་སྤྱོད་ཨུཏ་པ་ལ་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས། ཡང་དང་ཡང་བལྟས་ཏེ། སྤོས་འཚོང་གི་ཚོང་དཔོན་ལོངས་སྤྱོད་ཨུཏ་པ་ལའི་དྲུང་ནས་སོང་ངོ་། །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་གྲོང་ཁྱེར་ཁང་པ་བརྩེགས་པར་འགྲོ་བའི་ལམ་དུ་འཇུག་པའི་ཚེ། ལམ་གྱི་གྱེན་ཐུར་དང་། ལམ་མཉམ་པ་དང་། ལམ་གྱི་ཐག་ཐུག་དང་། ལམ་རྡུལ་ཡོད་པ་དང་། ལམ་རྡུལ་མེད་པ་དང་། ལམ་བདེ་བ་དང་།
en: “Then Sudhana, the head merchant’s son, bowed his head to the feet of the perfume-seller head merchant Utpalabhūti, circumambulated the perfume-seller head merchant Utpalabhūti a hundred thousand times, keeping him to his right, and, looking back again and again, departed from the presence of the perfume-seller head merchant Utpalabhūti.

source: ལམ་མི་བདེ་བ་དང་། ལམ་དོག་པ་དང་། ལམ་བགེགས་མེད་པ་དང་། ལམ་འཁྱུག་པ་དང་། ལམ་འཁྱུག་པ་མེད་པ་ལ་རྣམ་པར་དཔྱད་དེ་བལྟས་ནས་འདི་སྙམ་དུ་བསམས་སོ། །འདི་ལྟར་བདག་དགེ་བའི་བཤེས་གཉེན་དེའི་དྲུང་དུ་འགྲོ་བ་འདི་ནི།
en: Vaira Chapter 25 When Sudhana set out on the path to Kūṭāgāra, he observed and contemplated how the path could be upward or downward, even or uneven, dusty or free of dust, safe or hazardous, difficult or unobstructed, and crooked or straight.

source: བྱང་ཆུབ་སེམས་དཔའི་ལམ་གྱི་ནན་ཏན་གྱི་རྒྱུར་འགྱུར་རོ། །ཕ་རོལ་ཏུ་ཕྱིན་པའི་ལམ་གྱི་ནན་ཏན་གྱི་རྒྱུར་འགྱུར་རོ། །སེམས་ཅན་ལ་ཕན་གདགས་པའི་ལམ་གྱི་རྒྱུར་འགྱུར་རོ། །སེམས་ཅན་ཐམས་ཅད་བྱམས་སྡང་དང་། མཐོན་དམན་དུ་གྱུར་བའི་གཡང་ས་ལས་རྣམ་པར་བཟློག་པ་དང་། སེམས་ཅན་ཐམས་ཅད་མི་མཉམ་པའི་ནན་ཏན་ལས་བསྒྱུར་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཉོན་མོངས་པའི་རྡུལ་རབ་ཏུ་ཞི་བར་བྱ་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་མི་དགེ་བའི་ལྟ་བ་སྣ་ཚོགས་ཀྱི་སྡོང་དུམ་དང་། ཚེར་མ་དང་། གྱོ་མོ་དང་གསེག་མ་བསྩལ་བ་དང་། ཆོས་ཀྱི་དབྱིངས་བསྒྲིབས་པ་མེད་པ་ལ་གཞོལ་པར་བྱ་བ་དང་། ཐམས་ཅད་མཁྱེན་པའི་ཕོ་བྲང་དུ་ཐོགས་པ་མེད་པར་བསྐྱལ་བའི་རྒྱུར་འགྱུར་རོ། །
en: He thought, “This journey to a kalyāṇamitra will be a cause for the practice of the bodhisattva path, will be a cause of the practice of the path of the perfections, and will be a cause of the path of benefiting all beings, which will be a cause for turning all beings away from the precipice of attachment and aversion, of elation and depression; will be a cause for turning all beings away from a perception of inequality; will be a cause for removing the dust of the kleśas from all beings; will be a cause for clearing away the tree trunks, thorns, pebbles, and gravel of the various bad views of all beings; and, through their entering the unobscured realm of the Dharma, will be a cause for bringing them without hindrance to the palace of omniscience.
